"""
    函数参数
        实际参数:与形参进行对应
            1.位置实参:按顺序
                    函数名(数据1,数据2)
                2.序列实参:拆
                    函数名(*序列)
            3.关键字实参:按名字
                    函数名(形参名1=数据1,形参名2=数据2)
                4.字典实参:拆
                    函数名(**字典)

        形式参数:限制实参传递方式
            5.默认形参:实参可选
                    def 函数名(形参名1=数据1,形参名2=数据2)
            6.位置形参:实参必填
                    def 函数名(形参名1,形参名2)

            7.星号元组形参:多个位置实参合为一个元组
                    def 函数名(*args)
            8.双星号字典形参:多个关键字实参合为一个字典
                    def 函数名(**kwargs)

            9.命名关键字形参:必须是关键字实参
                    def 函数名(*args,形参名)
                    def 函数名(*,形参名)
"""

